; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-11)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 room4)
(at ball5 room4)
(at ball6 room5)
(at ball7 room5)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room5)
(at ball10 room6)
(at ball11 room6)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 4 of 11
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 11
3. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 5 of 11
4. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 5 of 11
5. (pick ball8 room5 left)
   deleted: (at ball8 room5) (free left)
   added: (carry ball8 left)
   goals met: 5 of 11
6. (pick ball7 room5 right)
   deleted: (at ball7 room5) (free right)
   added: (carry ball7 right)
   goals met: 5 of 11
7. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 5 of 11
8. (drop ball7 room4 right)
   deleted: (carry ball7 right)
   added: (at ball7 room4) (free right)
   goals met: 6 of 11
9. (drop ball8 room4 left)
   deleted: (carry ball8 left)
   added: (at ball8 room4) (free left)
   goals met: 7 of 11
10. (pick ball5 room4 left)
   deleted: (at ball5 room4) (free left)
   added: (carry ball5 left)
   goals met: 7 of 11
11. (pick ball4 room4 right)
   deleted: (at ball4 room4) (free right)
   added: (carry ball4 right)
   goals met: 7 of 11
12. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 7 of 11
13. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 8 of 11
14. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 8 of 11
15. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 8 of 11
16. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 9 of 11
17. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 9 of 11
18. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 9 of 11
19. (pick ball6 room5 left)
   deleted: (at ball6 room5) (free left)
   added: (carry ball6 left)
   goals met: 9 of 11
20. (pick ball10 room5 right)
   deleted: (at ball10 room5) (free right)
   added: (carry ball10 right)
   goals met: 9 of 11
21. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 9 of 11
22. (drop ball10 room6 right)
   deleted: (carry ball10 right)
   added: (at ball10 room6) (free right)
   goals met: 10 of 11
23. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 10 of 11
24. (drop ball6 room4 left)
   deleted: (carry ball6 left)
   added: (at ball6 room4) (free left)
   goals met: 11 of 11
